/*2050271 信20 张睿 */
/*20533398 马启越，2051837 覃政，2053021_周震东*/
#include <iostream>
#include <cstdio>
#include <cstdlib>
#include <ctime>
#include "16-b2-date.h"
#include "16-b2-time.h"
#include "16-b2-datetime.h"
using namespace std;


#if defined(__linux) || defined(__linux__) //Linux
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (getchar() != '\n')
		;
	cout << endl << endl;
}

#else //VS+Dev
#include <Windows.h>
#include <conio.h>
/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void wait_for_enter()
{
	cout << endl << "按回车键继续";
	while (_getch() != '\r')
		;
	cout << endl << endl;
}
#endif

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：main函数不准动，也不需要提交，检查时会替换（细节可能有错，如果发现请及时提出）
***************************************************************************/
int main()
{
	if (1)
	{
		cout << "data类测试开始" << endl;
		wait_for_enter();

		if (1) {
			Date d1;	//2000.1.1
			Date d2(2021, 4, 17);	//2021.4.17

			cout << "测试初始化，完全正确的赋值" << endl;

			cout << "d1应该是1900.1.1， 实际为：";
			cout << d1 << endl;
			cout << "d2应该是2021.4.17，实际为：";
			cout << d2 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(1870, 3, 15);
			Date d2(2112, 3, 4);
			Date d3(2005, 13, 15);
			Date d4(2021, 4, 32);

			cout << "测试初始化，年、月、日非法" << endl;

			cout << "d1应该是1900.1.1，实际为：";
			cout << d1 << endl;
			cout << "d2应该是1900.1.1, 实际为：";
			cout << d2 << endl;
			cout << "d3应该是1900.1.1，实际为：";
			cout << d3 << endl;
			cout << "d4应该是1900.1.1，实际为：";
			cout << d4 << endl;

			/* 多个错，按年月日顺序处理 */
			Date d5(1899, 2, 29);  //2000.2.29
			Date d6(1899, 2, 30);  //2000.2.1
			Date d7(1899, 13, 31); //2000.1.31
			Date d8(1899, 13, 32); //2000.1.1
			cout << "d5应该是1900.1.1，实际为：";
			cout << d5 << endl;
			cout << "d6应该是1900.1.1，实际为：";
			cout << d6 << endl;
			cout << "d7应该是1900.1.1，实际为：";
			cout << d7 << endl;
			cout << "d8应该是1900.1.1，实际为：";
			cout << d8 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(2021, 2, 29); //2021.2.1
			Date d2(2020, 2, 29); //2020.2.29

			cout << "测试初始化，闰年" << endl;

			cout << "d1应该是1900.1.1， 实际为：";
			cout << d1 << endl;
			cout << "d2应该是2020.2.29，实际为：";
			cout << d2 << endl;

			wait_for_enter();
		}

		/*
		if (1) {
			Date d1, d2, d3; //都是2000.1.1

			cout << "测试set，带缺省值" << endl;
			d1.set(2021, 4, 17);	//2021.4.17
			d2.set(2021, 4);		//2021.4.1
			d3.set(2021);		//2021.1.1

			cout << "d1应该是2021.4.17，实际为：";
			d1<<endl;
			cout << "d2应该是2021.4.1， 实际为：";
			d2<<endl;
			cout << "d3应该是2021.1.1， 实际为：";
			d3<<endl;

			wait_for_enter();
		}
		*/

		if (1) {
			Date d1(2021, 4, 17), d2(d1), d3(d1);

			cout << "测试set，不含错误" << endl;

			d1.set(1900, 1, 1);   //2007.4.17
			d2.set(2020, 2, 29);   //2021.3.18
			d3.set(2099, 12, 31);   //2021.4.28

			cout << "d1应该是1900.1.1 ，实际为：";
			cout << d1 << endl;
			cout << "d2应该是2020.2.29 ，实际为：";
			cout << d2 << endl;
			cout << "d3应该是2099.12.31 ，实际为：";
			cout << d3 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1, d2, d3, d4;

			cout << "测试set，年、月、日非法" << endl;

			d1.set(2112, 2, 29);  //2000.2.29
			d2.set(2019, 2, 29);  //2019.2.1
			d3.set(2021, 5, 32);  //2021.5.1
			d4.set(2021, 13, 12); //2021.1.12

			cout << "d1应该是1900.1.1 ， 实际为：";
			cout << d1 << endl;
			cout << "d2应该是1900.1.1 ，  实际为：";
			cout << d2 << endl;
			cout << "d3应该是1900.1.1 ，  实际为：";
			cout << d3 << endl;
			cout << "d4应该是1900.1.1 ， 实际为：";
			cout << d4 << endl;

			/* 多个错+带缺省值，按年月日顺序处理 */
			Date d5(2020, 1, 31), d6(d5), d7(d5), d8(d5), d9(d5), d10(d5), d11(d5);  //2020.1.31

			d5.set(1899, 2, 29);  //2000.2.29
			d6.set(1899, 2, 30);  //2000.2.1
			d7.set(1899, 2, 0);   //2000.2.1
			d8.set(0, 2, 0);      //2020.2.1
			d9.set(0, 13, 32);    //2020.1.1
			d10.set(1899, 13, 31);  //2000.1.31
			d11.set(1899, 13, 32);  //2000.1.1
			cout << "d5应该是1900.1.1 ，  实际为：";
			cout << d5 << endl;
			cout << "d6应该是1900.1.1 ，  实际为：";
			cout << d6 << endl;
			cout << "d7应该是1900.1.1 ，  实际为：";
			cout << d7 << endl;
			cout << "d8应该是1900.1.1 ，  实际为：";
			cout << d8 << endl;
			cout << "d9应该是1900.1.1 ，  实际为：";
			cout << d9 << endl;
			cout << "d10应该是1900.1.1 ， 实际为：";
			cout << d10 << endl;
			cout << "d11应该是1900.1.1 ， 实际为：";
			cout << d11 << endl;

			Date d12(2020, 2, 29), d13(2021, 3, 31);

			d12.set(2021, 0, 0); //2021.2.1
			d13.set(0, 4, 0);   //2021.4.1

			cout << "d12应该是1900.1.1 ， 实际为：";
			cout << d12 << endl;
			cout << "d13应该是1900.1.1 ， 实际为：";
			cout << d13 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(2021, 4, 17);
			Date d2;

			cout << "测试cout" << endl;
			cout << "d1应该是2021.4.17，实际为：" << d1 << endl;
			cout << "d2应该是1900.1.1， 实际为：" << d2 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1;

			cout << "测试cin/cout" << endl;

			cout << "请输入2021 4 17" << endl;
			cin >> d1;
			cout << "d1应该是2020.4.17，实际为：" << d1 << endl;

			cout << "请输入2020 2 29" << endl;
			cin >> d1;
			cout << "d1应该是2020.2.29，实际为：" << d1 << endl;

			cout << "请输入2021 2 29" << endl;
			cin >> d1;
			cout << "d1应该是1900.1.1，实际为：" << d1 << endl;

			cout << "请输入1899 4 10" << endl;
			cin >> d1;
			cout << "d1应该是1900.1.1，实际为：" << d1 << endl;

			cout << "请输入2021 13 10" << endl;
			cin >> d1;
			cout << "d1应该是1900.1.1，实际为：" << d1 << endl;

			cout << "请输入2021 4 31" << endl;
			cin >> d1;
			cout << "d1应该是1900.1.1，实际为：" << d1 << endl;

			cout << "请输入2112 15 34" << endl;
			cin >> d1;
			cout << "d1应该是1900.1.1，实际为：" << d1 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(1);          //1900.1.1
			Date d2(73049);      //2099.12.31
			Date d3(-100);       //1900.1.1
			Date d4(80000);      

			cout << "转换构造函数测试，包括合法及非法值" << endl;

			cout << "d1应该是1900.1.1，  实际为：";
			cout << d1 << endl;
			cout << "d2应该是2099.12.31，实际为：";
			cout << d2 << endl;
			cout << "d3应该是1900.1.1，  实际为：";
			cout << d3 << endl;
			cout << "d4应该是1900.1.1，实际为：";
			cout << d4 << endl;

			d1 = 30000;
			cout << "d1应该是1982.2.19， 实际为：";
			cout << d1 << endl;

			d2 = 44302;
			cout << "d2应该是2021.4.17， 实际为：";
			cout << d2 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(1900, 1, 1);
			Date d2(2099, 12, 31);
			Date d3(1982, 2, 19);
			Date d4(2021, 4, 17);

			cout << "类型转换函数测试，包括合法及非法值" << endl;

			cout << "d1应该是1，    实际为：" << int(d1) << endl;
			cout << "d2应该是73049，实际为：" << int(d2) << endl;
			cout << "d3应该是30000，实际为：" << int(d3) << endl;
			cout << "d4应该是44302，实际为：" << int(d4) << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(2021, 4, 17);
			Date d2;

			cout << "测试+/- n" << endl;

			d2 = d1 + 75;
			cout << "d2应该是2021.7.1，    实际为：" << d2 << endl;

			d2 = 75 + d1;
			cout << "d2应该是2021.7.1，    实际为：" << d2 << endl;

			d2 = d1 - 7;
			cout << "d2应该是2021.4.10，   实际为：" << d2 << endl;

			d1.set(2020, 2, 28);
			d2 = d1 + 3;
			cout << "d2应该是2020.3.2，    实际为：" << d2 << endl;

			d1.set(2021, 2, 28);
			d2 = d1 + 3;
			cout << "d2应该是2021.3.3，    实际为：" << d2 << endl;

			d1.set(2020, 12, 28);
			d2 = d1 + 5;
			cout << "d2应该是2021.1.2，    实际为：" << d2 << endl;

			d1.set(2021, 1, 1);
			d2 = d1 - 5;
			cout << "d2应该是2020.12.27，  实际为：" << d2 << endl;

			d1.set(2018, 12, 31);
			d2 = d1 + 366;
			cout << "d2应该是2020.1.1，    实际为：" << d2 << endl;

			d1.set(2019, 12, 31);
			d2 = d1 + 367;
			cout << "d2应该是2021.1.1，    实际为：" << d2 << endl;

			d1.set(2020, 1, 1);
			d2 = d1 - 366;
			cout << "d2应该是2018.12.31，  实际为：" << d2 << endl;

			d1.set(2021, 1, 1);
			d2 = d1 - 367;
			cout << "d2应该是2019.12.31，  实际为：" << d2 << endl;

			d1.set(1900, 1, 2);
			d2 = d1 - 10;
			cout << "d2应该是2099.12.23，  实际为：" << d2 << endl;

			d1.set(2099, 12, 30);
			d2 = d1 + 5;
			cout << "d2应该是1900.1.4，    实际为：" << d2 << endl;

			d1.set(2021, 5, 9);
			d2.set(2021, 4, 17);
			cout << "d1-d2应该是22，       实际为：" << d1 - d2 << endl;

			d1.set(2020, 4, 17);
			d2.set(2019, 4, 17);
			cout << "d1-d2应该是366，      实际为：" << d1 - d2 << endl;

			d1.set(2021, 4, 17);
			d2.set(2020, 4, 17);
			cout << "d1-d2应该是365，      实际为：" << d1 - d2 << endl;

			d1.set(2021, 4, 17);
			cout << "d1+14应该是2021.5.1， 实际为：" << d1 + 14 << endl;
			cout << "14+d1应该是2021.5.1， 实际为：" << 14 + d1 << endl;
			cout << "d1-17应该是2021.3.31，实际为：" << d1 - 17 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1(2021, 4, 17);
			Date d2(2021, 3, 11);

			cout << "测试-date" << endl;
			cout << "日期差值应为37， 实际为：" << d1 - d2 << endl;

			d2.set(2021, 4, 30);
			cout << "日期差值应为-13，实际为：" << d1 - d2 << endl;

			d1.set(2020, 3, 2);
			d2.set(2020, 2, 27);
			cout << "日期差值应为4，  实际为：" << d1 - d2 << endl;

			d1.set(2021, 3, 2);
			d2.set(2021, 2, 27);
			cout << "日期差值应为3，  实际为：" << d1 - d2 << endl;

			d1.set(2021, 1, 2);
			d2.set(2020, 12, 27);
			cout << "日期差值应为6，  实际为：" << d1 - d2 << endl;

			d1.set(2020, 1, 1);
			d2.set(2018, 12, 31);
			cout << "日期差值应为366，实际为：" << d1 - d2 << endl;

			d1.set(2021, 1, 1);
			d2.set(2019, 12, 31);
			cout << "日期差值应为367，实际为：" << d1 - d2 << endl;

			wait_for_enter();
		}

		if (1) {
			Date d1, d2;

			cout << "测试++/--" << endl;

			d1.set(2021, 4, 17);
			d2 = d1++;
			cout << "d1应该是2021.4.18， 实际为：" << d1 << endl;
			cout << "d2应该是2021.4.17， 实际为：" << d2 << endl;

			d1.set(2021, 4, 17);
			d2 = ++d1;
			cout << "d1应该是2021.4.18， 实际为：" << d1 << endl;
			cout << "d2应该是2021.4.18， 实际为：" << d2 << endl;

			d1.set(2021, 5, 1);
			d2 = d1--;
			cout << "d1应该是2021.4.30， 实际为：" << d1 << endl;
			cout << "d2应该是2021.5.1，  实际为：" << d2 << endl;

			d1.set(2021, 5, 1);
			d2 = --d1;
			cout << "d1应该是2021.4.30， 实际为：" << d1 << endl;
			cout << "d2应该是2021.4.30， 实际为：" << d2 << endl;

			d1.set(2020, 12, 31);
			d2 = d1++;
			cout << "d1应该是2021.1.1，  实际为：" << d1 << endl;
			cout << "d2应该是2020.12.31，实际为：" << d2 << endl;

			d1.set(2021, 1, 1);
			d2 = d1--;
			cout << "d1应该是2020.12.31，实际为：" << d1 << endl;
			cout << "d2应该是2021.1.1，  实际为：" << d2 << endl;

			d1.set(2020, 2, 28);
			d2 = d1++;
			cout << "d1应该是2020.2.29， 实际为：" << d1 << endl;
			cout << "d2应该是2020.2.28， 实际为：" << d2 << endl;

			d1.set(2021, 2, 28);
			d2 = d1++;
			cout << "d1应该是2021.3.1，  实际为：" << d1 << endl;
			cout << "d2应该是2021.2.28， 实际为：" << d2 << endl;

			d1.set(2020, 3, 1);
			d2 = d1--;
			cout << "d1应该是2020.2.29， 实际为：" << d1 << endl;
			cout << "d2应该是2020.3.1，  实际为：" << d2 << endl;

			d1.set(2021, 3, 1);
			d2 = d1--;
			cout << "d1应该是2021.2.28， 实际为：" << d1 << endl;
			cout << "d2应该是2021.3.1，  实际为：" << d2 << endl;

			d1.set(2099, 12, 31);
			d2 = d1++;
			cout << "d1应该是1900.1.1，  实际为：" << d1 << endl;
			cout << "d2应该是2099.12.31，实际为：" << d2 << endl;

			d1.set(1900, 1, 1);
			d2 = d1--;
			cout << "d1应该是2099.12.31，实际为：" << d1 << endl;
			cout << "d2应该是1900.1.1，，实际为：" << d2 << endl;

			wait_for_enter();
		}

		if (1) {
			/* 测试比较运算符 */
			Date d1(2021, 4, 17);
			Date d2(2021, 4, 17);
			Date d3(2021, 3, 27);

			cout << "测试比较运算符" << endl;

			cout << "比较结果应为0，实际为：" << (d1 > d2) << endl;
			cout << "比较结果应为1，实际为：" << (d1 >= d2) << endl;
			cout << "比较结果应为0，实际为：" << (d1 < d2) << endl;
			cout << "比较结果应为1，实际为：" << (d1 <= d2) << endl;
			cout << "比较结果应为1，实际为：" << (d1 == d2) << endl;
			cout << "比较结果应为0，实际为：" << (d1 != d2) << endl;

			cout << "比较结果应为1，实际为：" << (d1 > d3) << endl;
			cout << "比较结果应为1，实际为：" << (d1 >= d3) << endl;
			cout << "比较结果应为0，实际为：" << (d1 < d3) << endl;
			cout << "比较结果应为0，实际为：" << (d1 <= d3) << endl;
			cout << "比较结果应为0，实际为：" << (d1 == d3) << endl;
			cout << "比较结果应为1，实际为：" << (d1 != d3) << endl;

			wait_for_enter();
		}
	}

	if (1)
	{
		cout << "time类测试开始" << endl;
		wait_for_enter();

		if (1) {
			Time d1;				//2000.1.1
			Time d2(12, 10, 17);	//2021.4.17

			cout << "测试初始化，完全正确的赋值" << endl;

			cout << "d1应该是00:00:00, 实际为：";
			cout << d1 << endl;
			cout << "d2应该是12:10:17，实际为：";
			cout << d2 << endl;

			wait_for_enter();
		}
		if (1)
		{
			Time t1(1, 3, 60);
			Time t2(24, 3, 4);
			Time t3(5, 60, 15);
			Time t4(-1, 3, 3);
			Time t5(0, -3, 8);
			Time t6(0, 6, -4);

			cout << "测试初始化，年、月、日非法" << endl;

			cout << "t1应该是00:00:00，实际为：";
			cout << t1 << endl;
			cout << "t2应该是00:00:00, 实际为：";
			cout << t2 << endl;
			cout << "t3应该是00:00:00，实际为：";
			cout << t3 << endl;
			cout << "t4应该是00:00:00，实际为：";
			cout << t4 << endl;
			cout << "t5应该是00:00:00, 实际为：";
			cout << t5 << endl;
			cout << "t6应该是00:00:00，实际为：";
			cout << t6 << endl;

			wait_for_enter();
		}



		if (1)
		{
			cout << "测试set，不含错误" << endl;
			Time t1, t2, t3;
			t1.set(0, 0, 0);
			t2.set(23, 59, 59);
			t3.set(12, 12, 32);
			cout << "t1应该是00:00:00，实际为：";
			cout << t1<<endl;
			cout << "t2应该是23:59:59, 实际为：";
			cout << t2<<endl;
			cout << "t3应该是12:12:32，实际为：";
			cout << t3<<endl;

			wait_for_enter();
		}

		if (1)
		{
			cout << "测试set，年、月、日非法" << endl;
			Time t[9];
			t[0].set(24, 0, 0);
			t[1].set(23, 60, 59);
			t[2].set(23, 59, 60);
			t[3].set(-1, 0, 0);
			t[4].set(8, -1, 2);
			t[5].set(8, 8, -1);
			t[6].set(24, 60, 60);
			t[7].set(-1, 60, 32);
			t[8].set(4, 60, 73);
			cout << "t1应该是00:00:00，实际为：";
			cout << t[0] << endl;
			cout << "t2应该是00:00:00，实际为：";
			cout << t[1] << endl;
			cout << "t3应该是00:00:00，实际为：";
			cout << t[2] << endl;
			cout << "t4应该是00:00:00，实际为：";
			cout << t[3] << endl;
			cout << "t5应该是00:00:00，实际为：";
			cout << t[4] << endl;
			cout << "t6应该是00:00:00，实际为：";
			cout << t[5] << endl;
			cout << "t7应该是00:00:00，实际为：";
			cout << t[6] << endl;
			cout << "t8应该是00:00:00，实际为：";
			cout << t[7] << endl;
			cout << "t9应该是00:00:00，实际为：";
			cout << t[8] << endl;

			wait_for_enter();
		}



		if (1) {
			Time t1(12,34,32);
			Time t2;

			cout << "测试cout" << endl;
			cout << "t1应该是12:34:32，实际为：" << t1 << endl;
			cout << "t2应该是00:00:00， 实际为：" << t2 << endl;

			wait_for_enter();
		}

		if (1) {
			Time t1;

			cout << "测试cin/cout" << endl;

			cout << "请输入12 34 32" << endl;
			cin >> t1;
			cout << "t1应该是12:34:32，实际为：" << t1 << endl;

			cout << "请输入12 60 00" << endl;
			cin >> t1;
			cout << "t1应该是00:00:00，实际为：" << t1 << endl;

			cout << "请输入24 00 00" << endl;
			cin >> t1;
			cout << "t1应该是00:00:00，实际为：" << t1 << endl;

			cout << "请输入12 32 60" << endl;
			cin >> t1;
			cout << "t1应该是12:32:60，实际为：" << t1 << endl;

			wait_for_enter();
		}




		if (1)
		{
			Time t1(0);
			Time t2(86399);
			Time t3(-100);
			Time t4(86400);

			cout << "转换构造函数测试，包括合法及非法值" << endl;

			cout << "t1应该是00:00:00，实际为：";
			cout << t1<<endl;
			cout << "t2应该是23:59:59，实际为：";
			cout << t2<<endl;
			cout << "t3应该是00:00:00，实际为：";
			cout << t3<<endl;
			cout << "t4应该是00:00:00，实际为：";
			cout << t4<<endl;

			t1 = 30000;
			cout << "t1应该是08:20:00，实际为：";
			cout << t1<<endl;

			t2 = 44302;
			cout << "t2应该是12:18:22，实际为：";
			cout << t2<<endl;

			wait_for_enter();
		}

		if (1)
		{
			Time t1(0, 0, 1);
			Time t2(23, 59, 59);
			Time t3(12, 18, 22);
			Time t4(8, 20, 0);

			cout << "类型转换函数测试，包括合法及非法值" << endl;

			cout << "t1应该是1，    实际为：" << int(t1) << endl;
			cout << "t2应该是86399，实际为：" << int(t2) << endl;
			cout << "t3应该是44302，实际为：" << int(t3) << endl;
			cout << "t4应该是30000，实际为：" << int(t4) << endl;

			wait_for_enter();
		}

		if (1)
		{
			Time t1(0, 0, 0), t2;

			cout << "操作符+/-测试" << endl;
			t1.set(23, 59, 59);
			t1 = t1 + 1;
			cout << "t1应该是00:00:00，实际为：";
			cout << t1<<endl;

			t1.set(23, 59, 59);
			t1 = 5 + t1;
			cout << "t1应该是00:00:04，实际为：";
			cout << t1<<endl;

			t1.set(8, 22, 32);
			t1 = t1 + 120 * 60;
			cout << "t1应该是10:22:32，实际为：";
			cout << t1<<endl;

			t1 = 30 * 60 + t1;
			cout << "t1应该是10:52:32，实际为：";
			cout << t1<<endl;

			t1 = 10 * 60 + t1;
			cout << "t1应该是11:02:32，实际为：";
			cout << t1<<endl;

			t1 = t1 + (24 * 60 * 60 + 20 * 60);
			cout << "t1应该是11:22:32，实际为：";
			cout << t1<<endl;

			t1.set(0, 0, 1);
			t1 = t1 - 5;
			cout << "t1应该是23:59:56，实际为：";
			cout << t1<<endl;

			t1 = t1 - (24 * 60 * 60 * 3 + 30 * 60);
			cout << "t1应该是23:29:56，实际为：";
			cout << t1<<endl;

			t1 = t1 - 2 * 60 * 60 - 10 * 60;
			cout << "t1应该是21:19:56，实际为：";
			cout << t1<<endl;

			t1.set(12, 0, 0);
			t1 = t1 - 1 * 60 * 60 - 1;
			cout << "t1应该是10:59:59，实际为：";
			cout << t1<<endl;

			t1.set(0, 0, 0);
			t2.set(23, 59, 59);
			cout << "t1-t2应该是：-86399, 实际为：" << t1 - t2 << endl;

			t1.set(12, 5, 5);
			t2.set(5, 59, 43);
			cout << "t1-t2应该是：21922,  实际为：" << t1 - t2 << endl;

			t1.set(12, 0, 0);
			t2.set(11, 59, 59);
			cout << "t1-t2应该是：1,      实际为：" << t1 - t2 << endl;

			t2.set(12, 0, 0);
			t1.set(10, 59, 59);
			cout << "t1-t2应该是：-3601,  实际为：" << t1 - t2 << endl;

			wait_for_enter();
		}

		if (1)
		{
			Time t1, t2;
			cout << "测试前缀++/--" << endl;

			t1.set(10, 20, 0);
			t2 = ++t1;
			cout << "t1应该是10:20:01， 实际为：" << t1 << endl;
			cout << "t2应该是10:20:01， 实际为：" << t2 << endl;

			t1.set(22, 39, 59);
			t2 = ++t1;
			cout << "t1应该是22:40:00， 实际为：" << t1 << endl;
			cout << "t2应该是22:40:00， 实际为：" << t2 << endl;

			t1.set(22, 59, 59);
			t2 = ++t1;
			cout << "t1应该是23:00:00， 实际为：" << t1 << endl;
			cout << "t2应该是23:00:00， 实际为：" << t2 << endl;

			t1.set(23, 59, 59);
			t2 = ++t1;
			cout << "t1应该是00:00:00， 实际为：" << t1 << endl;
			cout << "t2应该是00:00:00， 实际为：" << t2 << endl;

			t1.set(21, 30, 10);
			t2 = --t1;
			cout << "t1应该是21:30:09， 实际为：" << t1 << endl;
			cout << "t2应该是21:30:09， 实际为：" << t2 << endl;

			t1.set(21, 30, 00);
			t2 = --t1;
			cout << "t1应该是21:29:59， 实际为：" << t1 << endl;
			cout << "t2应该是21:29:59， 实际为：" << t2 << endl;

			t1.set(22, 0, 0);
			t2 = --t1;
			cout << "t1应该是21:59:59， 实际为：" << t1 << endl;
			cout << "t2应该是21:59:59， 实际为：" << t2 << endl;

			wait_for_enter();
		}
		if(1)
		{
			cout << "测试后缀++/--" << endl;
			Time t1, t2;

			t1.set(0, 0, 0);
			t2 = --t1;
			cout << "t1应该是23:59:59， 实际为：" << t1 << endl;
			cout << "t2应该是23:59:59， 实际为：" << t2 << endl;

			t1.set(10, 20, 0);
			t2 = t1++;
			cout << "t1应该是10:20:01， 实际为：" << t1 << endl;
			cout << "t2应该是10:20:00， 实际为：" << t2 << endl;

			t1.set(22, 39, 59);
			t2 = t1++;
			cout << "t1应该是22:40:00， 实际为：" << t1 << endl;
			cout << "t2应该是22:39:59， 实际为：" << t2 << endl;

			t1.set(22, 59, 59);
			t2 = t1++;
			cout << "t1应该是23:00:00， 实际为：" << t1 << endl;
			cout << "t2应该是22:59:59， 实际为：" << t2 << endl;

			t1.set(23, 59, 59);
			t2 = t1++;
			cout << "t1应该是00:00:00， 实际为：" << t1 << endl;
			cout << "t2应该是23:59:59， 实际为：" << t2 << endl;


			t1.set(21, 30, 10);
			t2 = t1--;
			cout << "t1应该是21:30:09， 实际为：" << t1 << endl;
			cout << "t2应该是21:30:10， 实际为：" << t2 << endl;

			t1.set(21, 30, 00);
			t2 = t1--;
			cout << "t1应该是21:29:59， 实际为：" << t1 << endl;
			cout << "t2应该是21:30:00， 实际为：" << t2 << endl;

			t1.set(22, 0, 0);
			t2 = t1--;
			cout << "t1应该是21:59:59， 实际为：" << t1 << endl;
			cout << "t2应该是22:00:00， 实际为：" << t2 << endl;

			t1.set(0, 0, 0);
			t2 = t1--;
			cout << "t1应该是23:59:59， 实际为：" << t1 << endl;
			cout << "t2应该是00:00:00， 实际为：" << t2 << endl;

			wait_for_enter();
		}

		if (1)
		{
			cout << "测试比较运算符" << endl;
			Time t1, t2, t3;
			t1.set(12, 30, 0);
			t2.set(12, 30, 0);
			t3.set(11, 45, 32);

			cout << "比较结果应为0，实际为：" << (t1 > t2) << endl;
			cout << "比较结果应为1，实际为：" << (t1 >= t2) << endl;
			cout << "比较结果应为0，实际为：" << (t1 < t2) << endl;
			cout << "比较结果应为1，实际为：" << (t1 <= t2) << endl;
			cout << "比较结果应为1，实际为：" << (t1 == t2) << endl;
			cout << "比较结果应为0，实际为：" << (t1 != t2) << endl;

			cout << "比较结果应为1，实际为：" << (t1 > t3) << endl;
			cout << "比较结果应为1，实际为：" << (t1 >= t3) << endl;
			cout << "比较结果应为0，实际为：" << (t1 < t3) << endl;
			cout << "比较结果应为0，实际为：" << (t1 <= t3) << endl;
			cout << "比较结果应为0，实际为：" << (t1 == t3) << endl;
			cout << "比较结果应为1，实际为：" << (t1 != t3) << endl;

			wait_for_enter();
		}
	}

	if (1)
	{
		cout << "datetime类测试开始" << endl;
		wait_for_enter();

		if (1) {
			DateTime d1;				
			DateTime d2(2021, 5, 19, 12, 10, 17);

			cout << "测试初始化，完全正确的赋值" << endl;

			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << d1<<endl;
			cout << "d2应该是2021-05-19 12:10:17，实际为：";
			cout << d2<<endl;

			wait_for_enter();
		}
		if (1)
		{
			DateTime t1(2021, 1, 1, 1, 3, 60);
			DateTime t2(2021, 1, 1, 24, 3, 4);
			DateTime t3(2021, 1, 1, 5, 60, 15);
			DateTime t4(2021, 1, 1, -1, 3, 3);
			DateTime t5(2021, 1, 1, 0, -3, 8);
			DateTime t6(2021, 1, 1, 0, 6, -4);
			DateTime t7(1870, 3, 15, 0, 0, 0);
			DateTime t8(2112, 3, 4, 0, 0, 0);
			DateTime t9(2005, 13, 15, 0, 0, 0);
			DateTime t10(2021, 4, 32, 0, 0, 0);

			cout << "测试初始化，年、月、日、时、分、秒非法" << endl;

			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t1 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t2 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t3 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t4 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t5 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t6 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t7 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t8 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t9 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t10 << endl;

			wait_for_enter();
		}
		if (1)
		{
			cout << "测试set，不含错误" << endl;
			DateTime t1, t2, t3;
			t1.set(1900, 1, 1, 0, 0, 0);
			t2.set(2099, 12, 31, 23, 59, 59);
			t3.set(2021, 5, 19, 12, 12, 32);
			cout << "t1应该是1900-01-01 00:00:00，实际为：";
			cout << t1<<endl;
			cout << "t2应该是2099-12-32 23:59:59, 实际为：";
			cout << t2<<endl;
			cout << "t3应该是2021-05-19 12:12:32，实际为：";
			cout << t3 << endl;

			wait_for_enter();
		}

		if (1) {
			DateTime d1;

			cout << "测试cin/cout" << endl;

			cout << "请输入2021 4 17 23 33 32" << endl;
			cin >> d1;
			cout << "d1应该是2021-04-17 23:33:32，实际为：" << d1 << endl;

			cout << "请输入2020 2 29 23 59 59" << endl;
			cin >> d1;
			cout << "d1应该是2020-02-29 23:59:59，实际为：" << d1 << endl;

			cout << "请输入2021 2 29 0 0 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

			cout << "请输入1899 4 10 0 0 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

			cout << "请输入2021 13 10 0 0 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

			cout << "请输入2021 4 31 0 0 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

			cout << "请输入2112 15 34 0 0 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

			cout << "请输入2021 05 20 24 0 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;

			cout << "请输入2021 05 20 0 60 0" << endl;
			cin >> d1;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;
			wait_for_enter();
		}

		if (1)
		{
			cout << "测试set，年、月、日、时、分、秒非法" << endl;
			DateTime t[9], t7, t8, t9, t10;
			t[0].set(2021, 1, 1, 24, 0, 0);
			t[1].set(2021, 1, 1, 3, 60, 59);
			t[2].set(2021, 1, 1, 23, 59, 60);
			t[3].set(2021, 1, 1, -1, 0, 0);
			t[4].set(2021, 1, 1, 8, -1, 2);
			t[5].set(2021, 1, 1, 8, 8, -1);
			t[6].set(2021, 1, 1, 24, 60, 60);
			t[7].set(2021, 1, 1, -1, 60, 32);
			t[8].set(2021, 1, 1, 4, 60, 73);
			t7.set(1870, 3, 15, 0, 0, 0);
			t8.set(2112, 3, 4, 0, 0, 0);
			t9.set(2005, 13, 15, 0, 0, 0);
			t10.set(2021, 4, 32, 0, 0, 0);
			cout << "t1应该是1900-01-01 00:00:00，实际为：";
			cout << t[0] << endl;
			cout << "t2应该是1900-01-01 00:00:00，实际为：";
			cout << t[1] << endl;
			cout << "t3应该是1900-01-01 00:00:00，实际为：";
			cout << t[2] << endl;
			cout << "t4应该是1900-01-01 00:00:00，实际为：";
			cout << t[3] << endl;
			cout << "t5应该是1900-01-01 00:00:00，实际为：";
			cout << t[4] << endl;
			cout << "t6应该是1900-01-01 00:00:00，实际为：";
			cout << t[5] << endl;
			cout << "t7应该是1900-01-01 00:00:00，实际为：";
			cout << t[6] << endl;
			cout << "t8应该是1900-01-01 00:00:00，实际为：";
			cout << t[7] << endl;
			cout << "t9应该是1900-01-01 00:00:00，实际为：";
			cout << t[8] << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t7 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t8 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t9 << endl;
			cout << "d1应该是1900-01-01 00:00:00, 实际为：";
			cout << t10 << endl;

			wait_for_enter();
		}



		if (1) {
			long long a = (long long)73049 * 86400;
			DateTime d1(0);        
			DateTime d2(1);
			DateTime d3(-100);
			DateTime d4(a - 1);
			DateTime d5(a);

			cout << "转换构造函数测试，包括合法及非法值" << endl;

			cout << "d1应该是1900.01.01 00:00:00，实际为：";
			cout << d1 << endl;
			cout << "d2应该是1900.01.01 00:00:01，实际为：";
			cout << d2 << endl;
			cout << "d3应该是1900.01.01 00:00:00，实际为：";
			cout << d3 << endl;
			cout << "d4应该是2099.12.31 23:59:59，实际为：";
			cout << d4 << endl;
			cout << "d4应该是1900.01.01 00:00:00，实际为：";
			cout << d5 << endl;

			wait_for_enter();
		}

		if (1) {
			DateTime d1(1900, 1, 1, 0, 0, 0);
			DateTime d2(2099, 12, 31, 23, 59, 59);
			DateTime d3(2000, 2, 12, 10, 10, 10);

			cout << "类型转换函数测试，包括合法及非法值" << endl;

			cout << "d1应该是0         ，实际为：" << (long long)(d1) << endl;
			cout << "d2应该是6311433599，实际为：" << (long long)(d2) << endl;
			cout << "d3应该是3159339010，实际为：" << (long long)(d3) << endl;

			wait_for_enter();
		}


		if (1)
		{
			DateTime t1, t2;

			cout << "操作符+/-测试" << endl;
			t1.set(2099, 12, 31, 23, 59, 59);
			t1 = t1 + 5;
			cout << "t1应该是1900-01-01 00:00:04，实际为：";
			cout << t1 << endl;

			t1.set(2099, 12, 31, 23, 59, 50);
			t1 = 40 + t1;
			cout << "t1应该是1900-01-01 00:00:30，实际为：";
			cout << t1 << endl;

			t1.set(2021, 2, 28, 21, 3, 4);
			t1 = t1 + 24 * 60 * 60;
			cout << "t1应该是2021-03-01 21:03:04，实际为：";
			cout << t1 << endl;

			t1.set(2021, 12, 31, 23, 59, 59);
			t1 = t1 + 1 + 365 * 24 * 60 * 60;
			cout << "t1应该是2023-01-01 00:00:00，实际为：";
			cout << t1 << endl;

			t1.set(2015, 2, 28, 2, 3, 4);
			t1 = 5 * 365 * 24 * 60 * 60 + 2 * 24 * 60 * 60 + 5 * 60 * 60 + t1;
			cout << "t1应该是2020-02-29 07:03:04，实际为：";
			cout << t1 << endl;

			t1.set(1900,1,1,0,0,0);
			t1 = 6311433599 + t1;
			cout << "t1应该是2099-12-31 23:59:59，实际为：";
			cout << t1 << endl;
			
			t1.set(1900, 1, 1, 0, 0, 0);
			t1 = 6311433599 + t1 + 1;
			cout << "t1应该是1900-01-01 00:00:00，实际为：";
			cout << t1 << endl;

			t1.set(1900, 1, 1, 0, 0, 1);
			t1 = t1 - 5;
			cout << "t1应该是2099-12-31 23:59:56，实际为：";
			cout << t1 << endl;

			t1.set(1900, 1, 1, 0, 0, 0);
			t1 = t1 - 3 * 365 * 24 * 60 * 60 - 2 * 24 * 60 * 60;
			cout << "t1应该是2096-12-29 00:00:00，实际为：";
			cout << t1 << endl;

			t1.set(2020, 1, 1, 0, 0, 0);
			t1 = t1 - 365 * 24 * 60 * 60 - 1;
			cout << "t1应该是2018-12-31 23:59:59，实际为：";
			cout << t1 << endl;

			t1.set(2021, 1, 1, 0, 0, 0);
			t1 = t1 - 366 * 24 * 60 * 60 - 1;
			cout << "t1应该是2019-12-31 23:59:59，实际为：";
			cout << t1 << endl;

			wait_for_enter();
		}


		if (1) {
			DateTime d1, d2;

			cout << "测试-datetime" << endl;

			d1.set(0, 0, 0, 0, 0, 0);
			d2.set(2099, 12, 31, 23, 59, 59);
			cout << "t1-t2应该是：-6311433599, 实际为：" << d1 - d2 << endl;

			cout << "t1-t2应该是：6311433599 ，实际为：" << d2 - d1 << endl;

			d1.set(2021, 5, 20, 10, 10, 15);
			d2.set(2019, 2, 20, 10, 10, 15);
			cout << "t1-t2应该是：70848000   ，实际为：" << d1 - d2 << endl;

			d1.set(2020, 3, 2, 0, 0, 1);
			d2.set(2020, 2, 26, 0, 0, 0);
			cout << "t1-t2应该是：432001     ，实际为：" << d1 - d2 << endl;

			d1.set(2021, 3, 2, 0, 0, 0);
			d2.set(2021, 2, 27, 0, 0, 0);
			cout << "t1-t2应该是：259200     ，实际为：" << d1 - d2 << endl;

			d1.set(2021, 1, 2, 0, 0, 0);
			d2.set(2020, 12, 27, 0, 0, 0);
			cout << "t1-t2应该是：518400     ，实际为：" << d1 - d2 << endl;

			d1.set(2020, 1, 1, 0, 0, 0);
			d2.set(2018, 12, 31, 23, 59, 59);
			cout << "t1-t2应该是：31536001   ，实际为：" << d1 - d2 << endl;

			d1.set(2021, 1, 1, 0, 0, 0);
			d2.set(2019, 12, 31, 23, 59, 59);
			cout << "t1-t2应该是：31622401   ，实际为：" << d1 - d2 << endl;

			wait_for_enter();
		}

		if (1) {
			DateTime d1, d2;


			cout << "测试++/--" << endl;

			d1.set(2021, 4, 17, 23, 59, 59);
			d2 = d1++;
			cout << "d1应该是2021-04-18 00:00:00，实际为：" << d1 << endl;
			cout << "d2应该是2021-04-17 23:59:59，实际为：" << d2 << endl;			

			d1.set(2021, 4, 17, 23, 59, 59);
			d2 = ++d1;
			cout << "d1应该是2021-04-18 00:00:00，实际为：" << d1 << endl;
			cout << "d2应该是2021-04-18 00:00:00，实际为：" << d2 << endl;

			d1.set(2021, 5, 1, 0, 0, 0);
			d2 = d1--;
			cout << "d1应该是2021-04-30 23:59:59，实际为：" << d1 << endl;
			cout << "d2应该是2021-05-01 00:00:00，实际为：" << d2 << endl;

			d1.set(2021, 5, 1, 0, 0, 0);
			d2 = --d1;
			cout << "d1应该是2021-04-30 23:59:59，实际为：" << d1 << endl;
			cout << "d2应该是2021-04-30 23:59:59，实际为：" << d2 << endl;

			d1.set(2020, 12, 31, 23, 59, 59);
			d2 = d1++;
			cout << "d1应该是2021-01-01 00:00:00，实际为：" << d1 << endl;
			cout << "d2应该是2020-12-31 23:59:59，实际为：" << d2 << endl;

			d1.set(2021, 1, 1,0,0,0);
			d2 = d1--;
			cout << "d1应该是2020-12-31 23:59:59，实际为：" << d1 << endl;
			cout << "d2应该是2021-01-01 00:00:00，实际为：" << d2 << endl;

			d1.set(2020, 2, 28,23,59,59);
			d2 = d1++;
			cout << "d1应该是2020-02-29 00:00:00，实际为：" << d1 << endl;
			cout << "d2应该是2020-02-28 23:59:59，实际为：" << d2 << endl;

			d1.set(2021, 2, 28, 23, 59, 59);
			d2 = d1++;
			cout << "d1应该是2021-03-01 00:00:00，实际为：" << d1 << endl;
			cout << "d2应该是2021-02-28 23:59:59，实际为：" << d2 << endl;

			d1.set(2020, 3, 1, 0, 0, 0);
			d2 = d1--;
			cout << "d1应该是2020-02-29 23:59:59，实际为：" << d1 << endl;
			cout << "d2应该是2020-03-01 00:00:00，实际为：" << d2 << endl;

			d1.set(2021, 3, 1, 0, 0, 0);
			d2 = d1--;
			cout << "d1应该是2021-02-28 23:59:59，实际为：" << d1 << endl;
			cout << "d2应该是2021-03-01 00:00:00，实际为：" << d2 << endl;

			d1.set(2099, 12, 31, 23, 59, 59);
			d2 = d1++;
			cout << "d1应该是1900-01-01 00:00:00，实际为：" << d1 << endl;
			cout << "d2应该是2099-12-31 23:59:59，实际为：" << d2 << endl;

			d1.set(1900, 1, 1, 0, 0, 0);
			d2 = d1--;
			cout << "d1应该是2099-12-31 23:59:59，实际为：" << d1 << endl;
			cout << "d2应该是1900-01-01 00:00:00，实际为：" << d2 << endl;

			wait_for_enter();
		}

		if (1) 
		{
			DateTime d1(2021, 4, 17, 23, 11, 11);
			DateTime d2(2021, 4, 17, 23, 11, 11);
			DateTime d3(2021, 3, 27, 0, 0, 0);

			cout << "测试比较运算符" << endl;

			cout << "比较结果应为0，实际为：" << (d1 > d2) << endl;
			cout << "比较结果应为1，实际为：" << (d1 >= d2) << endl;
			cout << "比较结果应为0，实际为：" << (d1 < d2) << endl;
			cout << "比较结果应为1，实际为：" << (d1 <= d2) << endl;
			cout << "比较结果应为1，实际为：" << (d1 == d2) << endl;
			cout << "比较结果应为0，实际为：" << (d1 != d2) << endl;

			cout << "比较结果应为1，实际为：" << (d1 > d3) << endl;
			cout << "比较结果应为1，实际为：" << (d1 >= d3) << endl;
			cout << "比较结果应为0，实际为：" << (d1 < d3) << endl;
			cout << "比较结果应为0，实际为：" << (d1 <= d3) << endl;
			cout << "比较结果应为0，实际为：" << (d1 == d3) << endl;
			cout << "比较结果应为1，实际为：" << (d1 != d3) << endl;

			wait_for_enter();
		}
	}
	return 0;
}
